import math

pix = 4.95e-3*2 # размер пикселя
F = 35        # фокусное расстояние
P1 = 0.79175+0.9935+1.4297499999999999  # сумма пикселей вокруг звезды
P2 = 0.8514999999999999+1.2115+0.7010000000000001  # сумма пикселей без звезды
N = 13        # количество измеряемых пикселей
Mstar = 8.65  # звездная величина звезды

a = pix/F*180/math.pi*3600 # угловой размер пикселя, угл. сек

Pstar = P1 - P2      # поток света от звезды
Psky = P2 / N / a**2 # поток света от неба с угл секунды
dM = 2.5*math.log(Pstar/Psky)/math.log(10)
Msky = Mstar + dM

print(f"Sky has brightness {Msky:.2f} mag/arcsec2")
