# language: zh-CN
功能: flybirds功能测试-variables

场景：验证变量处理--变量初始化
当 变量赋值[test=123]

当 函数变量赋值[test=randint(1, 7899)]
# 随机整数。参数：取值上限，下限
# 左闭右闭，正负均可

当 函数变量赋值[test=randletter(8)]
# 随机字母。参数：字符串长度
# 包含a-z A-Z

当 函数变量赋值[test=randchar(8)]
# 随机中文。参数：字符串长度
# 包含GBK2313收录的6k+常用汉字

当 函数变量赋值[TEST=len(test)]
# 获取字符串长度。参数：需要获得长度的变量名

当 函数变量赋值[TEST=cropText(0.1888, 0.3566, 0.3740, 0.3845)]
# 指定区域文字存入变量。参数：区域类型，区域的左上角点 右下角点的相对坐标
# 坐标以屏幕左上角为原点，水平向右为x轴，垂直向下为y轴
# 使用相对坐标，依次为左上角点横坐标、左上角点横坐标、右下角点横坐标、右下角点纵坐标
# 有无空格均可，但必须正确使用逗号与()

当 函数变量赋值[TEST=time()]
# 获取当前服务器时间。无参数
# 日期格式：YYYY-MM-DD HH:mm:ss.ms

当 函数变量赋值[test=adb('adb shell ls')]
# 执行adb命令。参数：adb命令

场景: 验证变量处理--变量字符串处理
当 变量处理[test.substr(1, 10)]
# 按起始字符和截止字符匹配字符串。参数：起始字符，截止字符的索引。
# 当变量已经被初始化后，传入的默认值可以为空，下同
# 左闭右开，起始索引从0开始，截止索引超过len不会报错，会取到最后一位

当 变量处理[test.index_replace(1, a)]
# 按位处理字符串。参数：替换索引，替换的字符串。索引从0开始，超出len会报错

当 变量处理[test.re_replace(\w+, 012345)]
# 字符串正则替换。参数：正则表达式，替换的字符串

当 变量处理[test.str2digit()]
# 字符串转数字。参数：默认值，无参数

当 变量处理[test.digit2str()]
当 变量处理[TEST.digit2str()]
# 数字转字符串。参数：默认值，无参数

当 变量处理[test.concat(TEST)]
当 变量处理[test.concat(TEST, 1)]
当 变量处理[test.concat(TEST, -)]
# 字符串拼接。参数：默认值，被拼接的变量名，连接符。在原变量末尾，向后拼接
# 省略第二个参数，则不使用连接符，直接拼接
# 使用空格作为连接符，第二个参数为>=1的正整数，表示空格的个数
# 使用其他字符作为连接符，第二个参数为该字符

场景: 验证变量处理--对变量进行表达式断言
IF 表达式断言[TEST == 5]
当 点击[text=服饰]
ENDIF
当 表达式断言[TEST==5]
当 表达式断言[TEST<=7]
当 表达式断言[TEST>=2]
当 表达式断言[TEST!=8]
当 表达式断言[abs(TEST) != 8]
当 表达式断言[TEST%2 == 1]
#  支持>、 <、>=、<=、!=、==、+、 -、 *、 /、 ()、 //、abs、%
#  等于使用==，不要用=，表达式需要满足python的表达式格式
#  表达式中的空格无意义，加不加都可以

场景: 验证变量处理--四则运算后赋值
当 变量四则运算[Test = TEST*test]
当 变量四则运算[test1 = (TEST*10-test)//Test]
# 支持+、 -、 *、 /、 ()、 //
# 表达式中的空格无意义，加不加都可以
