# language: zh-CN
功能: flybirds功能测试-android click

场景: 验证点击--点击屏幕位置
当   启动APP[ctrip.android.view]
而且 点击屏幕位置[580,1200]
而且 等待[5]秒
那么 全屏截图
那么 关闭App


场景: 验证点击--点击元素
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=机票]
而且 点击[text=机票, timeout=1]
那么 全屏截图
# timeout的=前后不要加空格
# 默认超时时间为35s，不提供修改接口


场景: 验证点击--点击并输入
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=搜索]
而且 在[text=搜索]中输入[flybirds]
而且 等待[10]秒
那么 全屏截图

场景: 验证点击--在已经聚焦情况下直接输入文本
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=搜索]
而且 点击[text=搜索]
那么 输入[上海]
那么 全屏截图


场景: 验证点击--点击元素上/下/左/右元素
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=机票]
那么 点击 [text=机票] 右 [text=火车票]
而且 等待[5]秒
那么 全屏截图
那么 关闭App


场景: 验证点击--点击元素上/下/左/右元素
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=机票]
# 那么 点击 [text=微信] 右 [text=已开启]
# 那么 点击 图片[img/2.jpg] 左 图片[img/3.jpg]
那么 点击 文本[火车票] 下 文本[租车]
# 那么 点击 图片[img/3.jpg] 上 文本[酒店]
# 那么 点击 文本[酒店] 下 图片[img/3.jpg]
# 那么 点击 图片[img/3.jpg] 上 [text=酒店]
# 那么 点击 [text=酒店] 下 图片[img/3.jpg]
# 那么 点击 文本[旅游] 左 [text=机票]
# 那么 点击 [text=微信] 右 文本[已开启]
而且 等待[5]秒
那么 全屏截图
那么 关闭App

场景: 验证点击--自动点击弹框
当 继续系统框监控
当 暂停系统框监控
# 默认为关闭自动弹框检测

场景: 验证点击--AI点击图标
当 AI图标点击[45678]

场景: 验证点击--多次点击
当 点击[text=显示刷新频率, freq=5]
当 点击屏幕位置[0.8703,0.4916, freq=5]
# 如果无freq参数，则默认点击一次