# language: zh-CN
功能: flybirds功能测试-android swipe

场景: 验证滑动--元素滑动
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=租车]
而且 [text=租车]向上滑动[600]
而且 等待[5]秒
那么 元素[text=租车]位置[5]秒内未变动
那么 存在元素[text=搜索]
那么 存在[搜索]的文案


场景: 验证滑动--全屏滑动
当  启动APP[ctrip.android.view]
而且 页面渲染完成出现元素[text=租车]
而且 全屏向上滑动[600, readyTime=3, duration=2]
那么 不存在[text=机票]的元素
那么 不存在[升级攻略]的文案
那么 元素[text=机票]消失
那么 文案[机票]消失

场景: 验证滑动--图片滑动
当 图片[1.jpg, 2.jpg, index=2]向右滑动[600]
# index从1开始
# 按纵坐标递增排序，纵坐标相同按照横坐标递增排序

场景: 验证滑动--坐标滑动
当 从[0.7, 0.01]向[0.5, 0.2]滑动
# 相对坐标，分别为起始位置和终止位置的x y坐标

场景: 验证拖动--图标拖动
当 拖动[text=QQ]到[0.5, 0.5]
# 相对坐标，拖动抵达位置的x y坐标
# 支持通过xpath定位图标